NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_lmac_peripherals.h
#define UARTE23_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define UARTE23_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define UARTE23_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define UARTE23_TIMEOUT_INTERRUPT 1                  /*!< Timeout interrupt is included.                                       */
#define UARTE23_CONFIGURABLE_DATA_FRAME_SIZE 1       /*!< Supports data frame sizes 4, 5, 6, 7, 8, and 9 bits.                 */
#define UARTE23_CORE_FREQUENCY 16                    /*!< Peripheral clock frequency is 16 MHz.                                */
#define UARTE23_CORE_CLOCK_16 1                      /*!< (unspecified)                                                        */
#define UARTE23_SHORTS_ENDTX_STOPTX 1                /*!< (unspecified)                                                        */
#define UARTE23_DMAEND_PRESENT 1                     /*!< (unspecified)                                                        */
#define UARTE23_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */

#define UARTE24_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define UARTE24_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define UARTE24_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define UARTE24_TIMEOUT_INTERRUPT 1                  /*!< Timeout interrupt is included.                                       */
#define UARTE24_CONFIGURABLE_DATA_FRAME_SIZE 1       /*!< Supports data frame sizes 4, 5, 6, 7, 8, and 9 bits.                 */
#define UARTE24_CORE_FREQUENCY 16                    /*!< Peripheral clock frequency is 16 MHz.                                */
#define UARTE24_CORE_CLOCK_16 1                      /*!< (unspecified)                                                        */
#define UARTE24_SHORTS_ENDTX_STOPTX 1                /*!< (unspecified)                                                        */
#define UARTE24_DMAEND_PRESENT 1                     /*!< (unspecified)                                                        */
#define UARTE24_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */

#define UARTE30_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define UARTE30_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define UARTE30_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define UARTE30_TIMEOUT_INTERRUPT 1                  /*!< Timeout interrupt is included.                                       */
#define UARTE30_CONFIGURABLE_DATA_FRAME_SIZE 1       /*!< Supports data frame sizes 4, 5, 6, 7, 8, and 9 bits.                 */
#define UARTE30_CORE_FREQUENCY 16                    /*!< Peripheral clock frequency is 16 MHz.                                */
#define UARTE30_CORE_CLOCK_16 1                      /*!< (unspecified)                                                        */
#define UARTE30_SHORTS_ENDTX_STOPTX 1                /*!< (unspecified)                                                        */
#define UARTE30_DMAEND_PRESENT 1                     /*!< (unspecified)                                                        */
#define UARTE30_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 0 /*!< (unspecified)                                                  */

/*MRAM controller*/
#define MRAMC_PRESENT 1
#define MRAMC_COUNT 1

#define MRAMC_NMRAMWORDSIZE 128                      /*!< (unspecified)                                                        */
#define MRAMC_NMRAMPAGESIZE 4                        /*!< (unspecified)                                                        */
#define MRAMC_NNVRPAGESIZE 4                         /*!< (unspecified)                                                        */
#define MRAMC_NMAINMEMORYSIZE 4                      /*!< MRAM main memory size: 4 MB                                          */
#define MRAMC_NNVRPAGES_MIN 0                        /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC_NNVRPAGES_MAX 3                        /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC_NNVRPAGES_SIZE 4                       /*!< Number of MRAM NVR pages: 0..3                                       */
#define MRAMC_NSIZEMRAMWORDS_MIN 1                   /*!< Register ERASE.SIZE.SIZE range: 1..262144                            */
#define MRAMC_NSIZEMRAMWORDS_MAX 262144              /*!< Register ERASE.SIZE.SIZE range: 1..262144                            */
#define MRAMC_NSIZEMRAMWORDS_SIZE 262145             /*!< Register ERASE.SIZE.SIZE range: 1..262144                            */
#define MRAMC_MARMDATAWIDTHWORDS_MIN 0               /*!< (unspecified)                                                        */
#define MRAMC_MARMDATAWIDTHWORDS_MAX 3               /*!< (unspecified)                                                        */
#define MRAMC_MARMDATAWIDTHWORDS_SIZE 4              /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGEUPPER 1                         /*!< The fields UREN and UWEN at CONFIGNVR.PAGE register are available.   */
#define MRAMC_NVRPAGELOWER 1                         /*!< The fields LREN, LWEN, LRSIZE and LWSIZE at CONFIGNVR.PAGE register
                                                          are available.*/
#define MRAMC_NVRPAGEENABLENORMALWRITE 1             /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELRSIZEBITS_MIN 24               /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELRSIZEBITS_MAX 27               /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELRSIZEBITS_SIZE 28              /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELRSIZERESET 15                  /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELRSIZEVALUE_MIN 0               /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELRSIZEVALUE_MAX 15              /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELRSIZEVALUE_SIZE 16             /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELWSIZEBITS_MIN 28               /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELWSIZEBITS_MAX 31               /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELWSIZEBITS_SIZE 32              /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELWSIZERESET 15                  /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELWSIZEVALUE_MIN 0               /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELWSIZEVALUE_MAX 15              /*!< (unspecified)                                                        */
#define MRAMC_NVRPAGELWSIZEVALUE_SIZE 16             /*!< (unspecified)                                                        */
#define MRAMC_DEPRECATEERASEALL 1                    /*!< MRAMC ERASEALL register is deprecated; use CTRLAP ERASEALL instead   */

/*GPIO high-speed pad control*/
#define GPIOHSPADCTRL_PRESENT 1
#define GPIOHSPADCTRL_COUNT 1

#define GPIOHSPADCTRL_NUM_ELASTIC_BUFFERS_MIN 0      /*!< Number of elastic buffers                                            */
#define GPIOHSPADCTRL_NUM_ELASTIC_BUFFERS_MAX 1      /*!< Number of elastic buffers                                            */
#define GPIOHSPADCTRL_NUM_ELASTIC_BUFFERS_SIZE 2     /*!< Number of elastic buffers                                            */
#define GPIOHSPADCTRL_PHASEPOLARITY 1                /*!< Supports full phase and polarity selection on both input and output. */

/*GPIO Port*/
#define GPIO_PRESENT 1
#define GPIO_COUNT 5

#define P2_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP4 1                            /*!< (unspecified)                                                        */
#define P2_CTRLSEL_MAP5 0                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P2_PIN_NUM_MAX 11                            /*!< (unspecified)                                                        */
#define P2_PIN_NUM_SIZE 12                           /*!< (unspecified)                                                        */
#define P2_FEATURE_PINS_PRESENT 4095                 /*!< (unspecified)                                                        */
#define P2_FEATURE_I5_LIBRARY 0                      /*!< (unspecified)                                                        */
#define P2_PIN_SENSE_MECHANISM 0                     /*!< (unspecified)                                                        */
#define P2_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P2_WEAKPU 0                                  /*!< (unspecified)                                                        */
#define P2_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P2_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P2_SLEWMODE 0                                /*!< (unspecified)                                                        */
#define P2_PULLSTR 0                                 /*!< (unspecified)                                                        */
#define P2_SUPPORT_1V2 0                             /*!< (unspecified)                                                        */
#define P2_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P2_BIASCTRL 0                                /*!< (unspecified)                                                        */
#define P2_PHASEPOLARITY 0                           /*!< (unspecified)                                                        */

#define P1_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP4 1                            /*!< (unspecified)                                                        */
#define P1_CTRLSEL_MAP5 0                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P1_PIN_NUM_MAX 15                            /*!< (unspecified)                                                        */
#define P1_PIN_NUM_SIZE 16                           /*!< (unspecified)                                                        */
#define P1_FEATURE_PINS_PRESENT 65535                /*!< (unspecified)                                                        */
#define P1_FEATURE_I5_LIBRARY 0                      /*!< (unspecified)                                                        */
#define P1_PIN_SENSE_MECHANISM 1                     /*!< I/O pins on this port have pin sense mechanism                       */
#define P1_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P1_WEAKPU 0                                  /*!< (unspecified)                                                        */
#define P1_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P1_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P1_SLEWMODE 0                                /*!< (unspecified)                                                        */
#define P1_PULLSTR 0                                 /*!< (unspecified)                                                        */
#define P1_SUPPORT_1V2 0                             /*!< (unspecified)                                                        */
#define P1_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P1_BIASCTRL 0                                /*!< (unspecified)                                                        */
#define P1_PHASEPOLARITY 0                           /*!< (unspecified)                                                        */

#define P3_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP4 1                            /*!< (unspecified)                                                        */
#define P3_CTRLSEL_MAP5 0                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P3_PIN_NUM_MAX 11                            /*!< (unspecified)                                                        */
#define P3_PIN_NUM_SIZE 12                           /*!< (unspecified)                                                        */
#define P3_FEATURE_PINS_PRESENT 4095                 /*!< (unspecified)                                                        */
#define P3_FEATURE_I5_LIBRARY 0                      /*!< (unspecified)                                                        */
#define P3_PIN_SENSE_MECHANISM 1                     /*!< I/O pins on this port have pin sense mechanism                       */
#define P3_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P3_WEAKPU 0                                  /*!< (unspecified)                                                        */
#define P3_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P3_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P3_SLEWMODE 0                                /*!< (unspecified)                                                        */
#define P3_PULLSTR 0                                 /*!< (unspecified)                                                        */
#define P3_SUPPORT_1V2 0                             /*!< (unspecified)                                                        */
#define P3_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P3_BIASCTRL 0                                /*!< (unspecified)                                                        */
#define P3_PHASEPOLARITY 0                           /*!< (unspecified)                                                        */

#define P4_CTRLSEL_MAP1 0                            /*!< (unspecified)                                                        */
#define P4_CTRLSEL_MAP2 0                            /*!< (unspecified)                                                        */
#define P4_CTRLSEL_MAP3 0                            /*!< (unspecified)                                                        */
#define P4_CTRLSEL_MAP4 1                            /*!< (unspecified)                                                        */
#define P4_CTRLSEL_MAP5 0                            /*!< (unspecified)                                                        */
#define P4_PIN_NUM_MIN 0                             /*!< (unspecified)                                                        */
#define P4_PIN_NUM_MAX 11                            /*!< (unspecified)                                                        */
#define P4_PIN_NUM_SIZE 12                           /*!< (unspecified)                                                        */
#define P4_FEATURE_PINS_PRESENT 4095                 /*!< (unspecified)                                                        */
#define P4_FEATURE_I5_LIBRARY 0                      /*!< (unspecified)                                                        */
#define P4_PIN_SENSE_MECHANISM 1                     /*!< I/O pins on this port have pin sense mechanism                       */
#define P4_DRIVECTRL 0                               /*!< (unspecified)                                                        */
#define P4_WEAKPU 0                                  /*!< (unspecified)                                                        */
#define P4_RETAIN 0                                  /*!< (unspecified)                                                        */
#define P4_PWRCTRL 0                                 /*!< (unspecified)                                                        */
#define P4_SLEWMODE 0                                /*!< (unspecified)                                                        */
#define P4_PULLSTR 0                                 /*!< (unspecified)                                                        */
#define P4_SUPPORT_1V2 0                             /*!< (unspecified)                                                        */
#define P4_PIN_OWNER_SEC 0                           /*!< (unspecified)                                                        */
#define P4_BIASCTRL 0                                /*!< (unspecified)                                                        */
#define P4_PHASEPOLARITY 0                           /*!< (unspecified)                                                        */

